mamedev/mame/src/devices/bus/p2000/m2200.cpp
// license:BSD-3-Clause
// copyright-holders:Bart Eversdijk
/**********************************************************************

    P2000 (M2200 Multi Purpose) Floppy Dics Controller Card

**********************************************************************/


#include "m2200.h"

#define LOG_IRQ    (1U << 1)   // CTC / FDC interrupt
#define LOG_FDC    (1U << 2)   // Floppy disk controller states
#define LOG_RAMDSK (1U << 3)   // RAM disk access
#define LOG_CENT   (1U << 4)   // Centronics port

#define VERBOSE (LOG_GENERAL)
#include "logmacro.h"

#define LOGIRQ(...)     LOGMASKED(LOG_IRQ, __VA_ARGS__)
#define LOGFDC(...)     LOGMASKED(LOG_FDC, __VA_ARGS__)
#define LOGRAMDSK(...)  LOGMASKED(LOG_RAMDSK, __VA_ARGS__)
#define LOGCENT(...)    LOGMASKED(LOG_CENT, __VA_ARGS__)

//**************************************************************************
//  DEVICE DEFINITIONS
//**************************************************************************

DEFINE_DEVICE_TYPE(P2000_FDC,    p2000_fdc_device,                 "p2kfdc",    "P2000 Floppy Disk Controller")
DEFINE_DEVICE_TYPE(P2000_M2200,  p2000_m2200_multipurpose_device,  "p2km2200",  "P2000 Miniware M2200 Multi Purpose FDC - 256K RAM disk")
DEFINE_DEVICE_TYPE(P2000_M2200D, p2000_m2200d_multipurpose_device, "p2km2200d", "P2000 Miniware M2200D Multi Purpose FDC - 64K RAM disk")

static DEVICE_INPUT_DEFAULTS_START( rs232 )
    DEVICE_INPUT_DEFAULTS( "RS232_TXBAUD", 0xff, RS232_BAUD_2400 )
    DEVICE_INPUT_DEFAULTS( "RS232_RXBAUD", 0xff, RS232_BAUD_2400 )
    DEVICE_INPUT_DEFAULTS( "RS232_DATABITS", 0xff, RS232_DATABITS_8 )
    DEVICE_INPUT_DEFAULTS( "RS232_PARITY", 0xff, RS232_PARITY_NONE )
    DEVICE_INPUT_DEFAULTS( "RS232_STOPBITS", 0xff, RS232_STOPBITS_1 )
DEVICE_INPUT_DEFAULTS_END


// Floppy formats
void p2000_fdc_device::floppy_formats(format_registration &fr)
{
    fr.add(FLOPPY_P2000T_FORMAT);
}

//FLOPPY_DSK_FORMAT - FLOPPY_P2000T_FORMAT
static void p2000t_floppies(device_slot_interface &device)
{
    device.option_add("35ss40",  FLOPPY_35_SSDD);        // 3.5"  single sided 40 tracks
    device.option_add("35ds40",  FLOPPY_35_DD);          // 3.5"  double sided 40 tracks
    device.option_add("35ds80",  FLOPPY_35_HD);          // 3.5"  double sided 35 tracks
    device.option_add("525ss35", FLOPPY_525_SSSD);       // 5.25" single sided 35 tracks
    device.option_add("525ds35", FLOPPY_525_SD);         // 5.25" double sided 35 tracks
    device.option_add("525ss40", FLOPPY_525_SSDD);       // 5.25" single sided 40 tracks
    device.option_add("525ds40", FLOPPY_525_DD);         // 5.25" double sided 40 tracks
    device.option_add("525ds80", FLOPPY_525_QD);         // 5.25" double sided 80 tracks
}

#define P2000T_FDC_MOTOR_ON 0x00
#define P2000T_FDC_MOTOR_OFF 0x01

WRITE_LINE_MEMBER(p2000_fdc_device::fdc_interrupt)
{
    LOGIRQ("M2200/FDC Interrupt %d\n", state);
    m_slot->irq_w(state);
}

void p2000_fdc_device::device_add_mconfig(machine_config &config)
{
    Z80CTC(config, m_ctc, 4_MHz_XTAL);
    m_ctc->intr_callback().set(FUNC(p2000_fdc_device::fdc_interrupt));

    z80_device *maincpu = nullptr;
    maincpu = config.root_device().subdevice<z80_device>("maincpu");
    if (maincpu != nullptr)
    {
        maincpu->set_daisy_config(get_z80_daisy_config());
    }

    // The floppy drive driver
    UPD765A(config, m_fdc, 4_MHz_XTAL, true, true);
    m_fdc->intrq_wr_callback().set(FUNC(p2000_fdc_device::fdc_irq_trigger));
    m_fdc->idx_wr_callback().set(FUNC(p2000_fdc_device::fdc_index_trigger));
    m_fdc->hdl_wr_callback().set(FUNC(p2000_fdc_device::fdc_hdl_wr_trigger));

    // Drive 0 is not connected so start with drive 1
    for (int i = 1; i < m_num_of_drives; i++)
    {
        FLOPPY_CONNECTOR(config, m_floppy[i], p2000t_floppies, m_floppy_def_param[i], floppy_formats); //.enable_sound(true);
    }
}

void p2000_m2200_multipurpose_device::device_add_mconfig(machine_config &config)
{
    Z80CTC(config, m_ctc, 2.5_MHz_XTAL);
    m_ctc->intr_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_interrupt));

    z80_device *maincpu = nullptr;
    maincpu = config.root_device().subdevice<z80_device>("maincpu");
    if (maincpu != nullptr)
    {
        maincpu->set_daisy_config(get_z80_daisy_config());
    }

    /* The floppy drive driver */
    UPD765A(config, m_fdc, 4_MHz_XTAL, true, true);
    m_fdc->intrq_wr_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_irq_trigger));
    m_fdc->idx_wr_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_index_trigger));
    m_fdc->hdl_wr_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_hdl_wr_trigger));

    // Drive 0 is not supported so start with drive 1
    for (int i = 1; i < m_num_of_drives; i++)
    {
        FLOPPY_CONNECTOR(config, m_floppy[i], p2000t_floppies, m_floppy_def_param[i], floppy_formats); //.enable_sound(true);
    }

    /* Set up realtime clock */
    MC146818(config, m_rtc, 32.768_kHz_XTAL).set_24hrs(true);
    m_rtc->irq().set(m_ctc, FUNC(z80ctc_device::trg2));

    /* Set up RS232/RS422 port */
    Z80CTC(config, m_ctc2, 2.5_MHz_XTAL);
    m_ctc2->intr_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_interrupt));
    m_ctc2->set_clk<0>(2.5_MHz_XTAL);
    m_ctc2->set_clk<1>(2.5_MHz_XTAL);
    m_ctc2->set_clk<2>(2.5_MHz_XTAL);
    m_ctc2->set_clk<3>(2.5_MHz_XTAL);
    m_ctc2->zc_callback<0>().set("sio", FUNC(z80sio_device::rxca_w));
    m_ctc2->zc_callback<1>().set("sio", FUNC(z80sio_device::txca_w));

    clock_device &sio_clock(CLOCK(config, "sio_clock", 2.5_MHz_XTAL));
    sio_clock.signal_handler().set("sio", FUNC(z80sio_device::rxtxcb_w));

    z80sio_device &sio(Z80SIO(config, "sio", 2.5_MHz_XTAL));
    sio.out_int_callback().set(FUNC(p2000_m2200_multipurpose_device::fdc_interrupt));
    sio.out_txda_callback().set("rs232", FUNC(rs232_port_device::write_txd));
    sio.out_rtsa_callback().set("rs232", FUNC(rs232_port_device::write_rts));
    sio.out_dtra_callback().set("rs232", FUNC(rs232_port_device::write_dtr));

    sio.out_txdb_callback().set("rs422", FUNC(rs232_port_device::write_txd));

