mamedev/mame/src/devices/bus/p2000/m2200.cpp
    rs232_port_device &rs232(RS232_PORT(config, "rs232", default_rs232_devices, nullptr));
    rs232.rxd_handler().set("sio", FUNC(z80sio_device::rxa_w));
    rs232.cts_handler().set("sio", FUNC(z80sio_device::ctsa_w));
    rs232.dcd_handler().set("sio", FUNC(z80sio_device::dcda_w));
    rs232.set_option_device_input_defaults("printer", DEVICE_INPUT_DEFAULTS_NAME(rs232));
    rs232.set_option_device_input_defaults("null_modem", DEVICE_INPUT_DEFAULTS_NAME(rs232));
    rs232.set_option_device_input_defaults("terminal", DEVICE_INPUT_DEFAULTS_NAME(rs232));

    rs232_port_device &rs422(RS232_PORT(config, "rs422", default_rs232_devices, nullptr));
    rs422.rxd_handler().set("sio", FUNC(z80sio_device::rxb_w));

    /* Set up centronics port */
    CENTRONICS(config, m_centronics, centronics_devices, "printer");
    m_centronics->ack_handler().set(FUNC(p2000_m2200_multipurpose_device::centronics_ack_w));
    m_centronics->busy_handler().set(FUNC(p2000_m2200_multipurpose_device::centronics_busy_w));
    m_centronics->perror_handler().set(FUNC(p2000_m2200_multipurpose_device::centronics_paper_empty_w));
    m_centronics->select_handler().set(FUNC(p2000_m2200_multipurpose_device::centronics_printer_on_w));
    m_centronics->fault_handler().set(FUNC(p2000_m2200_multipurpose_device::centronics_error_w));
}


//**************************************************************************
//  LIVE DEVICE
//**************************************************************************

//-------------------------------------------------
//  Constructors
//-------------------------------------------------

p2000_fdc_device::p2000_fdc_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock)
    : device_t(mconfig, type, tag, owner, clock)
    , device_p2000_expansion_slot_card_interface(mconfig, *this)
        , m_ctc(*this, "ctc")
        , m_fdc(*this, "fdc")
        , m_floppy(*this, "fdc:%u", 0)
{
}

p2000_fdc_device::p2000_fdc_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
    : p2000_fdc_device(mconfig, P2000_FDC, tag, owner, clock)
{
}

p2000_m2200_multipurpose_device::p2000_m2200_multipurpose_device(const machine_config &mconfig, device_type type,  const char *tag, device_t *owner, uint32_t clock)
    : p2000_fdc_device(mconfig, type, tag, owner, clock)
    , m_rtc(*this, "rtc")
    , m_ctc2(*this, "ctc2")
    , m_sio(*this, "sio")
    , m_centronics(*this, "centronics")
{
}

p2000_m2200_multipurpose_device::p2000_m2200_multipurpose_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
    : p2000_m2200_multipurpose_device(mconfig, P2000_M2200, tag, owner, clock)
{
}

p2000_m2200d_multipurpose_device::p2000_m2200d_multipurpose_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
    : p2000_m2200_multipurpose_device(mconfig, P2000_M2200D, tag, owner, clock)
{
}

void p2000_fdc_device::device_start()
{
    // FDC Init ready control logic timer
    m_ready_control_timer = machine().scheduler().timer_alloc(timer_expired_delegate(FUNC(p2000_fdc_device::ready_timer_cb), this));

    m_slot->io_space().install_readwrite_handler(0x88, 0x8b, read8sm_delegate(*m_ctc, FUNC(z80ctc_device::read)), write8sm_delegate(*m_ctc, FUNC(z80ctc_device::write)));
    m_slot->io_space().install_read_handler(0x8c, 0x8c, read8smo_delegate(*m_fdc, FUNC(upd765a_device::msr_r)));
    m_slot->io_space().install_readwrite_handler(0x8d, 0x8d, read8smo_delegate(*this, FUNC(p2000_fdc_device::fdc_read)), write8smo_delegate(*this, FUNC(p2000_fdc_device::fdc_write)));
    m_slot->io_space().install_readwrite_handler(0x90, 0x90, read8smo_delegate(*this, FUNC(p2000_fdc_device::fdc_fcdr)), write8smo_delegate(*this, FUNC(p2000_fdc_device::fdc_control)));
}

void p2000_m2200_multipurpose_device::device_start()
{
    // reserve memory for ram-disk  256KB or 64KB
    m_ramdisk = std::make_unique<uint8_t[]>(get_ramdrive_size());

    // FDC Init ready control logic timer
    m_ready_control_timer = machine().scheduler().timer_alloc(timer_expired_delegate(FUNC(p2000_m2200_multipurpose_device::ready_timer_cb), this));

    // SIO - RS232/RS422 handlers
    m_slot->io_space().install_readwrite_handler(0x80, 0x83, read8sm_delegate(*m_ctc2, FUNC(z80ctc_device::read)), write8sm_delegate(*m_ctc2, FUNC(z80ctc_device::write)));
    m_slot->io_space().install_readwrite_handler(0x84, 0x87, read8sm_delegate(*m_sio, FUNC(z80sio_device::ba_cd_r)), write8sm_delegate(*m_sio, FUNC(z80sio_device::ba_cd_w)));

    // FDC - handlers
    m_slot->io_space().install_readwrite_handler(0x88, 0x8b, read8sm_delegate(*m_ctc, FUNC(z80ctc_device::read)), write8sm_delegate(*m_ctc, FUNC(z80ctc_device::write)));
    m_slot->io_space().install_read_handler(0x8c, 0x8c, read8smo_delegate(*m_fdc, FUNC(upd765a_device::msr_r)));
    m_slot->io_space().install_readwrite_handler(0x8d, 0x8d, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::fdc_read)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::fdc_write)));
    m_slot->io_space().install_readwrite_handler(0x90, 0x90, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::fdc_fcdr)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::fdc_control)));

    // RAM disk handlers
    m_slot->io_space().install_readwrite_handler(0x95, 0x95, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_95_r)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_95_w)));
    m_slot->io_space().install_readwrite_handler(0x96, 0x96, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_96_r)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_96_w)));
    m_slot->io_space().install_readwrite_handler(0x97, 0x97, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_97_r)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_97_w)));

    // Real time clock handlers
    m_slot->io_space().install_readwrite_handler(0x9c, 0x9d, read8sm_delegate(*m_rtc, FUNC(mc146818_device::read)), write8sm_delegate(*m_rtc, FUNC(mc146818_device::write)));

