mamedev/mame/src/devices/bus/p2000/m2200.cpp
    // Centronics handlers
    m_slot->io_space().install_write_handler(0x98, 0x98, write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_98_w)));
    m_slot->io_space().install_read_handler(0x99, 0x99, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_99_r)));
    m_slot->io_space().install_readwrite_handler(0x9a, 0x9a, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_9a_r)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_9a_w)));
    m_slot->io_space().install_readwrite_handler(0x9b, 0x9b, read8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_9b_r)), write8smo_delegate(*this, FUNC(p2000_m2200_multipurpose_device::port_9b_w)));
}

//-------------------------------------------------
//  device_reset - device-specific reset
//-------------------------------------------------
void p2000_fdc_device::device_reset()
{
    LOG("FDC device reset\n");
    // Reset ready control logic
    m_ready_control_pulse_cnt = 0;
}

void p2000_m2200_multipurpose_device::device_reset()
{
    LOG("M2200 device reset\n");

    // Init RAM disk registers
    m_ramdisk_track = 0;
    m_ramdisk_sector = 0;
    m_ramdisk_sector = 0;

    // Preset RTC
    m_rtc->write(0, 10);    // REG_A
    m_rtc->write(1, 0x20);  // progam correct cristal setttings
    m_rtc->write(0, 0);     // Back to default register

    // Reset ready control logic
    m_ready_control_pulse_cnt = 0;

    /* ack = 1, busy = 1, paper empty = 1, printer on = 1, error = 0 */
    m_centronics_status = 0x0f;
    m_centronics->write_strobe(1);
}

//**************************************************************************
//  IMPLEMENTATION
//**************************************************************************
/*
  FDC 0x8c - 0x8f Floppy controller upd765a
       0x8c  Input Status FDC
       0x8d  !fdc_control_reg bit 0: data I/O disk memory
             fdc_control_reg bit 0: fdc status reg
       0x8e  n.a.
       0x8f  n.a.
*/
uint8_t p2000_fdc_device::fdc_read()
{
    return (!BIT(m_fdc_control_reg, 0) ? m_fdc->fifo_r() : m_fdc->dma_r());
}

void p2000_fdc_device::fdc_write(uint8_t data)
{
    if (!BIT(m_fdc_control_reg, 0))
    {
        m_fdc->fifo_w(data);
    }
    else
    {
        m_fdc->dma_w(data);
    }
}

/* -------------------------------------------------
    FDC 0x90 control
      bit 0  FDC enable
             0: data transport
             1: register read/write
      bit 1  Terminal count FDC
      bit 2  FDC reset-n
      bit 3  motor on
------------------------------------------------- */
void p2000_fdc_device::fdc_control(uint8_t data)
{
    LOGFDC("FDC control = %02x \n", data);

    // BIT(data,1); --> Terminal count FDC
    if (BIT(m_fdc_control_reg, 0) && !BIT(data, 0))
    {   // Toggle tc when old fdc enable state was ative and is going to low
        LOGFDC("toggle tc (FCE = %02x)\n", BIT(m_fdc_control_reg, 0));
        m_fdc->tc_w(1);
    }
    m_fdc->tc_w(BIT(data,1));

    // BIT(data,2); --> FDC reset-n
    m_fdc->reset_w(BIT(data,2) ? 0 : 1);

    // BIT(data,3); --> motor on/off  (only update on change OR after reset)
    if ((BIT(data, 3) != BIT(m_fdc_control_reg, 3)) || m_fdc_control_reg < 0)
    {
        //floppy_image_device *floppy = nullptr;
        for (int i = 1; i < m_num_of_drives; i++)
        {
            LOGFDC("Flop %d motor = %s \n", i, BIT(data, 3) ? "on" : "off");
            if (m_floppy[i])
            {
                m_floppy[i]->get_device()->mon_w((BIT(data, 3) ? P2000T_FDC_MOTOR_ON : P2000T_FDC_MOTOR_OFF));
            }
            else
            {
                LOGFDC("Skip Flop %d\n", i);
            }
        }
    }

    // Store BIT(data,0); -->  FDC enable
    m_fdc_control_reg = data;
}

uint8_t p2000_fdc_device::fdc_fcdr()
{
    // DRQ line is represented in BIT 0 of port 90h
    return (m_fdc->get_drq() ? 0x01 : 0x0);
}

/* -------------------------------------------------
FDC - Ready control logic
 FNR-N is connected to trg1 of ctc
    If upd765-HDL line is high -> logic is disabled and thus FNR-N line is low (FNR-N is connected to trg1 of ctc)
    FNR-N line gives single pulse when INDEX-N pulse was not dectected within defined time frame (5 disk revolutions)
    this mechanism was design to detect disk absense in drive (or no drive connect at all)
------------------------------------------------- */
WRITE_LINE_MEMBER(p2000_fdc_device::fdc_index_trigger)
{
    LOGFDC("FDC Index trigger (state = %02x)\n", state);
    if (m_fdc_hdl_line)
    {
        // falling edge --> negative puls restart ready control network
        if (m_fdc_index_n && !state)
        {
            if (m_ready_control_pulse_cnt < 1)
            {
                // Only 1 index pulse restarts allowed per HDL line pulse --> one revoluition per read/write
                LOGFDC("FDC Index trigger restart timer (pulse cnt %d) \n", m_ready_control_pulse_cnt);
                m_ready_control_timer->adjust(attotime::from_msec(m_ready_control_delay)); // single shot
                m_ready_control_pulse_cnt++;
            }
        }
    }
    m_fdc_index_n = state;
}

//-------------------------------------------------
//  FDC - implement WR trigger circuit
//-------------------------------------------------
WRITE_LINE_MEMBER(p2000_fdc_device::fdc_hdl_wr_trigger)
{
    m_fdc_hdl_line = state;
    if (state)
    {
        LOGFDC("FDC HDL WR trigger -> Set ready control timer\n");
        m_ready_control_timer->adjust(attotime::from_msec(m_ready_control_delay)); // single shot
    }
    else
    {   // Enabling the upd765-HDL line will cause a drop of trg1 (FNR-N line)
        LOGFDC("FDC HDL WR trigger -> Reset control timer\n");
        m_ctc->trg1(0);
        m_ready_control_timer->reset();
        m_ready_control_pulse_cnt = 0;
    }
}

//-------------------------------------------------
//  FDC - floppy controller int triggers ctc channel 0
//-------------------------------------------------
WRITE_LINE_MEMBER(p2000_fdc_device::fdc_irq_trigger)
{
    LOGIRQ("FDC IRQ %1x\n", state);
    m_ctc->trg0(state);
}

//-------------------------------------------------
//  FDC - implement read trigger ctc channel 1 (FDC error trigger)
//-------------------------------------------------
TIMER_CALLBACK_MEMBER(p2000_fdc_device::ready_timer_cb)
{
    LOGFDC("Ready control trigger (hdl = %1x)\n", m_fdc_hdl_line);
    // If the ready logic timer expired signal CTC trigger 1
    if (m_fdc_hdl_line)
    {
        m_ctc->trg1(1);
        m_ctc->trg1(0);
    }
}

//-------------------------------------------------
//  dew_r - vblank trigger server check
//-------------------------------------------------
uint8_t p2000_fdc_device::dew_r()
{
    m_ctc->trg3(1);
    m_ctc->trg3(0);
    return 1;
}

