mamedev/mame/src/devices/bus/p2000/m2200.cpp
/* -------------------------------------------------
    RAM disk
     1 sector has 256 bytes
     2 track has 16 sectors
     max 16 or 64 tracks
------------------------------------------------- */
//-------------------------------------------------
//  RAM disk - set track number
//-------------------------------------------------
void p2000_m2200_multipurpose_device::port_95_w(uint8_t data)
{
    m_ramdisk_track = data & get_ramdrive_max_tracks_mask();
    LOGRAMDSK("RAMDISK set trk=%d\n", m_ramdisk_track);
}

//-------------------------------------------------
//  RAM disk - read track number
//-------------------------------------------------
uint8_t p2000_m2200_multipurpose_device::port_95_r()
{
    return m_ramdisk_track;
}

//-------------------------------------------------
//  RAM disk - set sector number and reset byte counter
//-------------------------------------------------
void p2000_m2200_multipurpose_device::port_96_w(uint8_t data)
{
    m_ramdisk_sector = data & 0x0F; // Max 16 sectors
    m_ramdisk_index = 0; // Reset "byte in sector"-counter
    LOGRAMDSK("RAMDISK set sec=%d\n", m_ramdisk_sector);
}

//-------------------------------------------------
//  RAM disk - read sector number
//-------------------------------------------------
uint8_t p2000_m2200_multipurpose_device::port_96_r()
{
    return m_ramdisk_sector;
}

//-------------------------------------------------
//  RAM disk - read byte number and inc byte counter
//-------------------------------------------------
uint8_t p2000_m2200_multipurpose_device::port_97_r()
{
    uint8_t b = m_ramdisk[(m_ramdisk_track * 16 * 256) + (m_ramdisk_sector * 256) + m_ramdisk_index];
    m_ramdisk_index = (m_ramdisk_index + 1) & 0xff;
    return b;
}

//-------------------------------------------------
//  RAM disk - write byte number and inc byte counter
//-------------------------------------------------
void p2000_m2200_multipurpose_device::port_97_w(uint8_t data)
{
    m_ramdisk[(m_ramdisk_track * 16 * 256) + (m_ramdisk_sector * 256) + m_ramdisk_index] = data;
    m_ramdisk_index = (m_ramdisk_index + 1) & 0xff;
}

//-------------------------------------------------
//  Centronics - data register
//-------------------------------------------------
void p2000_m2200_multipurpose_device::port_98_w(uint8_t data)
{
    m_centronics->write_data0(BIT(data, 0));
    m_centronics->write_data1(BIT(data, 1));
    m_centronics->write_data2(BIT(data, 2));
    m_centronics->write_data3(BIT(data, 3));
    m_centronics->write_data4(BIT(data, 4));
    m_centronics->write_data5(BIT(data, 5));
    m_centronics->write_data6(BIT(data, 6));
    m_centronics->write_data7(BIT(data, 7));
}

/* -------------------------------------------------
     Centronics - get status register
       BIT
        0    ackn
        1    busy
        2    paper empty
        3    printer on
        4    error-n
------------------------------------------------- */
WRITE_LINE_MEMBER(p2000_m2200_multipurpose_device::centronics_ack_w)
{
    LOGCENT("ACK-N %02x\n", state);
    if (state)
        m_centronics_status |= 0x1;
     else
        m_centronics_status &= ~0x1;
}

WRITE_LINE_MEMBER(p2000_m2200_multipurpose_device::centronics_busy_w)
{
    LOGCENT("BUSY-N %02x\n", state);
    if (state)
        m_centronics_status |= 0x2;
     else
        m_centronics_status &= ~0x2;
}

WRITE_LINE_MEMBER(p2000_m2200_multipurpose_device::centronics_paper_empty_w)
{
    LOGCENT("EMPTY-N %02x\n", state);
    if (state)
        m_centronics_status |= 0x4;
     else
        m_centronics_status &= ~0x4;
}

WRITE_LINE_MEMBER(p2000_m2200_multipurpose_device::centronics_printer_on_w)
{
    LOGCENT("printer-N %02x\n", state);
    if (state)
        m_centronics_status |= 0x8;
     else
        m_centronics_status &= ~0x8;
}

WRITE_LINE_MEMBER(p2000_m2200_multipurpose_device::centronics_error_w)
{
    LOGCENT("ERROR-N %02x\n", state);
    if (!state) // Inverted
        m_centronics_status |= 0x10;
     else
        m_centronics_status &= ~0x10;
}

uint8_t p2000_m2200_multipurpose_device::port_99_r()
{
    return m_centronics_status;
}

//-------------------------------------------------
//  Centronics - accessing port 9a will set strobe signal
//-------------------------------------------------

void p2000_m2200_multipurpose_device::port_9a_w(uint8_t data)
{
    LOGCENT("strobe-N 1\n");
    m_centronics->write_strobe(1);
}

uint8_t p2000_m2200_multipurpose_device::port_9a_r()
{
    LOGCENT("strobe-N 1\n");
    m_centronics->write_strobe(1);
    return 0;
}

//-------------------------------------------------
//  Centronics - accessing port 9a will reset strobe signal
//-------------------------------------------------
void p2000_m2200_multipurpose_device::port_9b_w(uint8_t data)
{
    LOGCENT("strobe-N 0\n");
    m_centronics->write_strobe(0);
}

uint8_t p2000_m2200_multipurpose_device::port_9b_r()
{
    LOGCENT("strobe-N 0\n");
    m_centronics->write_strobe(0);
    return 0;
}